export const data = [
  { label: "・0歳馬" },
  { label: "・1歳馬" },
  { label: "・2歳馬" },
  { label: "・繁殖馬" },
];

export const horseColor = [
  { 白毛: require("../assets/images/horse/22.png") },
  { 青鹿毛: require("../assets/images/horse/25.png") },
  { 栗毛: require("../assets/images/horse/23.png") },
  { 黑鹿毛: require("../assets/images/horse/24.png") },
  { 鹿毛: require("../assets/images/horse/21.png") },
];

export const raceWhipHorse = [
  {
    白毛: require("../assets/horseImageData/RaceHorseColor/2/White/2wakuL.gif"),
  },
  {
    青鹿毛: require("../assets/horseImageData/RaceHorseColor/1/BlueBayHair_Whip/1wakuL.gif"),
  },
  {
    青毛: require("../assets/horseImageData/RaceHorseColor/1/BlueBayHair_Whip/1wakuL.gif"),
  },
  {
    栗毛: require("../assets/horseImageData/RaceHorseColor/1/Chestnut_Whip/3wakuL.gif"),
  },
  {
    黑鹿毛: require("../assets/horseImageData/RaceHorseColor/1/BlackBayHair_Whip/4wakuL.gif"),
  },
  {
    鹿毛: require("../assets/horseImageData/RaceHorseColor/1/Kage_Whip/5wakuL.gif"),
  },
  {
    黒鹿毛: require("../assets/horseImageData/RaceHorseColor/1/BlackBayHair_Whip/4wakuL.gif"),
  },
  {
    芦毛: require("../assets/horseImageData/RaceHorseColor/1/BlackBayHair_Whip/4wakuL.gif"),
  },
];
// 黒鹿毛
export const raceHorse = [
  {
    白毛: require("../assets/horseImageData/RaceHorseColor/2/White/2wakuL.gif"),
  },
  {
    青鹿毛: require("../assets/horseImageData/RaceHorseColor/1/BlueBayHair/1wakuL.gif"),
  },
  {
    青毛: require("../assets/horseImageData/RaceHorseColor/1/BlueBayHair/1wakuL.gif"),
  },
  {
    栗毛: require("../assets/horseImageData/RaceHorseColor/1/Chestnut/3wakuL.gif"),
  },
  {
    黑鹿毛: require("../assets/horseImageData/RaceHorseColor/1/BlackBayHair/4wakuL.gif"),
  },
  {
    鹿毛: require("../assets/horseImageData/RaceHorseColor/1/Kage/5wakuL.gif"),
  },
  {
    黒鹿毛: require("../assets/horseImageData/RaceHorseColor/1/BlackBayHair/4wakuL.gif"),
  },
  {
    芦毛: require("../assets/horseImageData/RaceHorseColor/1/BlackBayHair/4wakuL.gif"),
  },
  {
    栃栗毛: require("../assets/horseImageData/RaceHorseColor/1/BlackBayHair/4wakuL.gif"),
  },
];

export const raceWhipReversHorse = [
  {
    白毛: require("../assets/horseImageData/RaceHorseColor/2-1/White_revers/2wakuR.gif"),
  },
  {
    青鹿毛: require("../assets/horseImageData/RaceHorseColor/1-1/BlueBayHair_Whip_revers/1wakuR.gif"),
  },
  {
    栗毛: require("../assets/horseImageData/RaceHorseColor/1-1/Chestnut_Whip_revers/3wakuR.gif"),
  },
  {
    黑鹿毛: require("../assets/horseImageData/RaceHorseColor/1-1/BlackBayHair_Whip_revers/4wakuR.gif"),
  },
  {
    芦毛: require("../assets/horseImageData/RaceHorseColor/1-1/BlackBayHair_Whip_revers/4wakuR.gif"),
  },
  {
    鹿毛: require("../assets/horseImageData/RaceHorseColor/1-1/Kage_Whip_revers/5wakuR.gif"),
  },
  {
    栃栗毛: require("../assets/horseImageData/RaceHorseColor/1-1/Kage_Whip_revers/5wakuR.gif"),
  },
];

export const raceReversHorse = [
  {
    白毛: require("../assets/horseImageData/RaceHorseColor/2-1/White_revers/2wakuR.gif"),
  },
  {
    青鹿毛: require("../assets/horseImageData/RaceHorseColor/1-1/BlueBayHair_revers/1wakuR.gif"),
  },
  {
    栗毛: require("../assets/horseImageData/RaceHorseColor/1-1/Chestnut_revers/3wakuR.gif"),
  },
  {
    黑鹿毛: require("../assets/horseImageData/RaceHorseColor/1-1/BlackBayHair_revers/4wakuR.gif"),
  },
  {
    鹿毛: require("../assets/horseImageData/RaceHorseColor/1-1/Kage_revers/5wakuR.gif"),
  },
];

export const horseSource = [
  { 1: require("../assets/horseImageData/1wakuL.gif") },
  { 2: require("../assets/horseImageData/2wakuL.gif") },
  { 3: require("../assets/horseImageData/3wakuL.gif") },
  { 4: require("../assets/horseImageData/4wakuL.gif") },
  { 5: require("../assets/horseImageData/5wakuL.gif") },
  { 6: require("../assets/horseImageData/6wakuL.gif") },
  { 7: require("../assets/horseImageData/7wakuL.gif") },
  { 8: require("../assets/horseImageData/8wakuL.gif") },
  { 9: require("../assets/horseImageData/9wakuL.gif") },
  { 10: require("../assets/horseImageData/10wakuL.gif") },
];

export const stillSource = [
  { 1: require("../assets/horseImageData/still/2.png") },
  { 2: require("../assets/horseImageData/still/4.png") },
  { 3: require("../assets/horseImageData/still/6.png") },
  { 4: require("../assets/horseImageData/still/8.png") },
  { 5: require("../assets/horseImageData/still/10.png") },
  { 6: require("../assets/horseImageData/still/12.png") },
  { 7: require("../assets/horseImageData/still/14.png") },
  { 8: require("../assets/horseImageData/still/16.png") },
  { 9: require("../assets/horseImageData/still/18.png") },
  { 10: require("../assets/horseImageData/still/20.png") },
];

export const numberSource = [
  { 1: require("../assets/horseImageData/Number/1.png") },
  { 2: require("../assets/horseImageData/Number/2.png") },
  { 3: require("../assets/horseImageData/Number/3.png") },
  { 4: require("../assets/horseImageData/Number/4.png") },
  { 5: require("../assets/horseImageData/Number/5.png") },
  { 6: require("../assets/horseImageData/Number/6.png") },
  { 7: require("../assets/horseImageData/Number/7.png") },
  { 8: require("../assets/horseImageData/Number/8.png") },
  { 9: require("../assets/horseImageData/Number/9.png") },
  { 10: require("../assets/horseImageData/Number/10.png") },
];

export const glasss = [
  require("../assets/horseImageData/NewBack/G-1.png"),
  require("../assets/horseImageData/NewBack/G-2.png"),
  require("../assets/horseImageData/NewBack/G-3.png"),
  require("../assets/horseImageData/NewBack/G-4.png"),
];

export const grouns = [
  require("../assets/horseImageData/NewBack/R-1.png"),
  require("../assets/horseImageData/NewBack/R-2.png"),
  require("../assets/horseImageData/NewBack/R-3.png"),
  require("../assets/horseImageData/NewBack/R-4.png"),
];

// ① ② ③ ④ ⑤ ⑥ ⑦ ⑧ ⑨ ⑩
export const numberCount = ["①", "②", "③", "④", "⑤", "⑥", "⑦", "⑧", "⑨", "⑩"];

export const constantKnicks = {
  'エーピーインディ': 0,
  'エクリプス': 1,
  'エタン': 2,
  'オーエンテューダー': 3,
  'ガリレオ': 4,
  'カロ': 5,
  'キングカメハメハ': 6,
  'グリーンデザート': 7,
  'グレイソヴリン': 8,
  'ゴーンウエスト': 9,
  'サーゲイロード': 10,
  'サドラーズウェルズ': 11,
  'サンインロー': 12,
  'サンデーサイレンス': 13,
  'シアトルスルー': 14,
  'スインフォード': 15,
  'ステイゴールド': 16,
  'ストームキャット': 17,
  'ストームバード': 18,
  'ゼダーン': 19,
  'セントサイモン': 20,
  'ダーレーアラビアン': 21,
  'ダマスカス': 22,
  'ダンチヒ': 23,
  'ダンテ': 24,
  'ディープインパクト': 25,
  'デインヒル': 26,
  'テスコボーイ': 27,
  'テディ': 28,
  'デピュティミニスター': 29,
  'トウルビヨン': 30,
  'トムフール': 31,
  'ナスルーラ': 32,
  'ニアークティック': 33,
  'ニジンスキー': 34,
  'ヌレイエフ': 35,
  'ネアルコ': 36,
  'ネイティヴダンサー': 37,
  'ネヴァーベンド': 38,
  'ノーザンダンサー': 39,
  'ノーザンテースト': 40,
  'パーソロン': 41,
  'バイアリーターク': 42,
  'ハイペリオン': 43,
  'ハンプトン': 44,
  'ヒムヤー': 45,
  'ファピアノ': 46,
  'ファラリス': 47,
  'フェアウェイ': 48,
  'フォーティナイナー': 49,
  'ブラッシンググルーム': 50,
  'ブランドフォード': 51,
  'プリンスリーギフト': 52,
  'プリンスローズ': 53,
  'ヘイルトゥリーズン': 54,
  'ヘロド': 55,
  'ベンドア': 56,
  'ボールドルーラー': 57,
  'マッチェム': 58,
  'マンノウォー': 59,
  'ミスタープロスペクター': 60,
  'ミルリーフ': 61,
  'リファール': 62,
  'リボー': 63,
  'レイズアネイティヴ': 64,
  'レッドゴッド': 65,
  'ロイヤルチャージャー': 66,
  'ロベルト': 67
};

export const marryAbilityData = {
  'S+': {
    'S+': [20, 18, 16, 14, 12, 8, 6, 4, 1, 1, 100],
    'S': [12, 20, 16, 16, 14, 10, 6, 4, 1, 1, 100],
    'A+': [8, 14, 20, 16, 16, 14, 6, 4, 1, 1, 100],
    'A': [4, 10, 16, 20, 18, 18, 6, 6, 1, 1, 100],
    'B+': [2, 4, 14, 18, 22, 20, 8, 8, 2, 2, 100],
    'B': [2, 4, 14, 16, 22, 22, 8, 8, 2, 2, 100],
    'C+': [2, 2, 12, 14, 24, 26, 8, 8, 2, 2, 100],
    'C': [2, 2, 12, 14, 24, 26, 8, 8, 2, 2, 100],
    'D+': [1, 2, 10, 12, 23, 24, 10, 10, 4, 4, 100],
    'D': [1, 2, 10, 12, 23, 24, 10, 10, 4, 4, 100],
  },
  'S': {
    'S+': [12, 20, 16, 16, 14, 10, 6, 4, 1, 1, 100],
    'S': [20, 18, 16, 14, 12, 8, 6, 4, 1, 1, 100],
    'A+': [6, 12, 18, 20, 18, 12, 6, 6, 1, 1, 100],
    'A': [4, 8, 14, 18, 22, 20, 6, 6, 1, 1, 100],
    'B+': [2, 6, 12, 14, 24, 26, 8, 6, 1, 1, 100],
    'B': [2, 4, 14, 14, 22, 24, 8, 8, 2, 2, 100],
    'C+': [1, 2, 10, 14, 24, 25, 10, 10, 2, 2, 100],
    'C': [1, 2, 10, 12, 25, 26, 10, 10, 2, 2, 100],
    'D+': [1, 2, 10, 12, 23, 24, 10, 10, 4, 4, 100],
    'D': [1, 2, 10, 12, 23, 24, 10, 10, 4, 4, 100],
  },
  'A+': {
    'S+': [8, 14, 20, 16, 16, 14, 6, 4, 1, 1, 100],
    'S': [6, 12, 18, 20, 18, 12, 6, 6, 1, 1, 100],
    'A+': [4, 10, 16, 18, 20, 18, 6, 6, 1, 1, 100],
    'A': [2, 8, 14, 16, 22, 22, 8, 6, 1, 1, 100],
    'B+': [1, 5, 12, 14, 24, 24, 8, 8, 2, 2, 100],
    'B': [1, 3, 10, 12, 26, 28, 8, 8, 2, 2, 100],
    'C+': [1, 1, 8, 10, 25, 27, 10, 10, 4, 4, 100],
    'C': [1, 1, 6, 10, 24, 28, 11, 11, 4, 4, 100],
    'D+': [1, 1, 4, 8, 22, 30, 13, 13, 4, 4, 100],
    'D': [1, 1, 2, 8, 20, 32, 14, 14, 4, 4, 100],
  },
  'A': {
    'S+': [6, 12, 18, 20, 18, 12, 6, 6, 1, 1, 100],
    'S': [4, 10, 16, 18, 20, 18, 6, 6, 1, 1, 100],
    'A+': [2, 8, 14, 16, 22, 22, 8, 6, 1, 1, 100],
    'A': [2, 6, 12, 14, 22, 24, 8, 8, 2, 2, 100],
    'B+': [1, 2, 10, 13, 26, 28, 8, 8, 2, 2, 100],
    'B': [1, 2, 8, 10, 24, 27, 10, 10, 4, 4, 100],
    'C+': [1, 1, 6, 10, 24, 28, 11, 11, 4, 4, 100],
    'C': [1, 1, 4, 8, 22, 30, 13, 13, 4, 4, 100],
    'D+': [1, 1, 2, 8, 20, 32, 14, 14, 4, 4, 100],
    'D': [1, 1, 2, 8, 20, 32, 14, 14, 4, 4, 100],
  },
  'B+': {
    'S+': [4, 10, 16, 18, 20, 18, 6, 6, 1, 1, 100],
    'S': [2, 8, 14, 16, 22, 22, 8, 6, 1, 1, 100],
    'A+': [1, 6, 12, 14, 23, 24, 8, 8, 2, 2, 100],
    'A': [1, 5, 11, 13, 24, 26, 8, 8, 2, 2, 100],
    'B+': [1, 2, 8, 10, 24, 27, 10, 10, 4, 4, 100],
    'B': [1, 2, 6, 10, 25, 28, 10, 10, 4, 4, 100],
    'C+': [1, 1, 4, 8, 22, 30, 13, 13, 4, 4, 100],
    'C': [1, 1, 2, 8, 20, 32, 14, 14, 4, 4, 100],
    'D+': [1, 1, 2, 8, 18, 30, 14, 14, 6, 6, 100],
    'D': [1, 1, 2, 8, 18, 30, 14, 14, 6, 6, 100],
  },
  'B': {
    'S+': [2, 8, 14, 16, 22, 22, 8, 6, 1, 1, 100],
    'S': [2, 6, 12, 14, 24, 26, 8, 6, 1, 1, 100],
    'A+': [1, 5, 10, 14, 24, 26, 8, 8, 2, 2, 100],
    'A': [1, 4, 8, 12, 26, 29, 8, 8, 2, 2, 100],
    'B+': [1, 2, 6, 10, 25, 28, 10, 10, 4, 4, 100],
    'B': [1, 2, 6, 10, 25, 28, 10, 10, 4, 4, 100],
    'C+': [1, 1, 4, 8, 22, 30, 13, 13, 4, 4, 100],
    'C': [1, 1, 2, 8, 20, 32, 14, 14, 4, 4, 100],
    'D+': [1, 1, 2, 8, 18, 30, 14, 14, 6, 6, 100],
    'D': [1, 1, 2, 8, 18, 30, 14, 14, 6, 6, 100],
  },
  'C+': {
    'S+': [2, 6, 12, 14, 24, 26, 8, 6, 1, 1, 100],
    'S': [1, 5, 10, 14, 24, 26, 8, 8, 2, 2, 100],
    'A+': [1, 4, 8, 12, 26, 29, 8, 8, 2, 2, 100],
    'A': [1, 3, 7, 11, 26, 32, 8, 8, 2, 2, 100],
    'B+': [1, 2, 6, 10, 25, 28, 10, 10, 4, 4, 100],
    'B': [1, 2, 6, 10, 25, 28, 10, 10, 4, 4, 100],
    'C+': [1, 1, 2, 8, 22, 30, 12, 12, 6, 6, 100],
    'C': [1, 1, 2, 8, 22, 30, 12, 12, 6, 6, 100],
    'D+': [1, 1, 2, 4, 18, 30, 14, 14, 8, 8, 100],
    'D': [1, 1, 2, 4, 18, 30, 14, 14, 8, 8, 100],
  },
  'C': {
    'S+': [2, 6, 12, 14, 24, 26, 8, 6, 1, 1, 100],
    'S': [1, 5, 10, 14, 24, 26, 8, 8, 2, 2, 100],
    'A+': [1, 4, 8, 12, 26, 29, 8, 8, 2, 2, 100],
    'A': [1, 3, 7, 11, 26, 32, 8, 8, 2, 2, 100],
    'B+': [1, 2, 6, 10, 25, 28, 10, 10, 4, 4, 100],
    'B': [1, 2, 6, 10, 25, 28, 10, 10, 4, 4, 100],
    'C+': [1, 1, 2, 8, 22, 30, 12, 12, 6, 6, 100],
    'C': [1, 1, 2, 8, 22, 30, 12, 12, 6, 6, 100],
    'D+': [1, 1, 2, 4, 18, 30, 14, 14, 8, 8, 100],
    'D': [1, 1, 2, 4, 18, 30, 14, 14, 8, 8, 100],
  },
  'D+': {
    'S+': [1, 4, 10, 15, 25, 25, 8, 8, 2, 2, 100],
    'S': [1, 3, 9, 14, 25, 28, 8, 8, 2, 2, 100],
    'A+': [1, 2, 8, 14, 26, 29, 8, 8, 2, 2, 100],
    'A': [1, 2, 7, 13, 27, 30, 8, 8, 2, 2, 100],
    'B+': [1, 1, 5, 10, 25, 30, 10, 10, 4, 4, 100],
    'B': [1, 1, 5, 10, 25, 30, 10, 10, 4, 4, 100],
    'C+': [1, 1, 2, 4, 18, 30, 14, 14, 8, 8, 100],
    'C': [1, 1, 2, 4, 18, 30, 14, 14, 8, 8, 100],
    'D+': [1, 1, 2, 2, 18, 30, 15, 15, 8, 8, 100],
    'D': [1, 1, 2, 2, 18, 30, 15, 15, 8, 8, 100]
  },
  'D': {
    'S+': [1, 4, 10, 15, 25, 25, 8, 8, 2, 2, 100],
    'S': [1, 3, 9, 14, 25, 28, 8, 8, 2, 2, 100],
    'A+': [1, 2, 8, 14, 26, 29, 8, 8, 2, 2, 100],
    'A': [1, 2, 7, 13, 27, 30, 8, 8, 2, 2, 100],
    'B+': [1, 1, 5, 10, 25, 30, 10, 10, 4, 4, 100],
    'B': [1, 1, 5, 10, 25, 30, 10, 10, 4, 4, 100],
    'C+': [1, 1, 2, 4, 18, 30, 14, 14, 8, 8, 100],
    'C': [1, 1, 2, 4, 18, 30, 14, 14, 8, 8, 100],
    'D+': [1, 1, 2, 2, 18, 30, 15, 15, 8, 8, 100],
    'D': [1, 1, 2, 2, 18, 30, 15, 15, 8, 8, 100]
  },
};

export const marryGrowData = {
  '早熟': {
    '早熟': [40, 30, 20, 2, 5, 3, 100],
    '早め': [30, 31, 22, 2, 8, 5, 100],
    '普通': [27, 27, 27, 2, 10, 7, 100],
    '持続': [25, 26, 26, 2, 12, 9, 100],
    '遅め': [20, 20, 23, 2, 20, 15, 100],
    '晩成': [12, 15, 21, 2, 25, 25, 100],
  },
  '普通': {
    '早熟': [27, 27, 27, 2, 10, 7, 100],
    '早め': [24, 26, 26, 2, 12, 10, 100],
    '普通': [20, 23, 29, 2, 14, 12, 100],
    '持続': [18, 20, 30, 2, 16, 14, 100],
    '遅め': [14, 18, 28, 2, 20, 18, 100],
    '晩成': [10, 14, 30, 2, 22, 22, 100]
  },
  '遅め': {
    '早熟': [10, 14, 30, 2, 22, 22, 100],
    '早め': [18, 20, 22, 2, 20, 18, 100],
    '普通': [14, 18, 28, 2, 20, 18, 100],
    '持続': [13, 15, 26, 2, 24, 20, 100],
    '遅め': [10, 13, 25, 2, 26, 24, 100],
    '晩成': [8, 10, 24, 2, 28, 28, 100]
  },
  '早め': {
    '早熟': [32, 31, 22, 2, 8, 5, 100],
    '早め': [28, 28, 24, 2, 10, 8, 100],
    '普通': [24, 26, 26, 2, 12, 10, 100],
    '持続': [22, 24, 26, 2, 14, 12, 100],
    '遅め': [18, 20, 22, 2, 20, 18, 100],
    '晩成': [15, 17, 22, 2, 22, 22, 100],
  },
  '持続': {
    '早熟': [25, 26, 26, 2, 12, 9, 100],
    '早め': [22, 24, 26, 2, 14, 12, 100],
    '普通': [18, 20, 30, 2, 16, 14, 100],
    '持続': [15, 18, 24, 10, 18, 15, 100],
    '遅め': [13, 15, 26, 2, 24, 20, 100],
    '晩成': [10, 12, 28, 2, 26, 22, 100],
  },
  '晩成': {
    '早熟': [12, 15, 21, 2, 25, 25, 100],
    '早め': [15, 17, 22, 2, 22, 22, 100],
    '普通': [10, 14, 30, 2, 22, 22, 100],
    '持続': [10, 12, 28, 2, 26, 22, 100],
    '遅め': [8, 10, 24, 2, 28, 28, 100],
    '晩成': [6, 8, 22, 2, 31, 31, 100],
  },

}

export const marryDistanceData = {
  '短': {
    '短': [40, 30, 20, 2, 5, 3, 100],
    '短中': [32, 31, 22, 2, 8, 5, 100],
    '中': [27, 27, 27, 2, 10, 7, 100],
    '万能': [25, 26, 26, 2, 12, 9, 100],
    '中長': [20, 20, 23, 2, 20, 15, 100],
    '長': [12, 15, 21, 2, 25, 25, 100],
  },
  '中': {
    '短': [27, 27, 27, 2, 10, 7, 100],
    '短中':[24, 26, 26, 2, 12, 10, 100],
    '中': [20, 23, 29, 2, 14, 12, 100],
    '万能':[18, 20, 30, 2, 16, 14, 100],
    '中長': [14, 18, 28, 2, 20, 18, 100],
    '長': [10, 14, 30, 2, 22, 22, 100],
  },
  '中長': {
    '短':[10, 14, 30, 2, 22, 22, 100],
    '短中': [18, 20, 22, 2, 20, 18, 100],
    '中': [14, 18, 28, 2, 20, 18, 100],
    '万能': [13, 15, 26, 2, 24, 20, 100],
    '中長': [10, 13, 25, 2, 26, 24, 100],
    '長': [8, 10, 24, 2, 28, 28, 100],
  },
  '短中': {
    '短': [32, 31, 22, 2, 8, 5, 100],
    '短中': [28, 28, 24, 2, 10, 8, 100],
    '中': [24, 26, 26, 2, 12, 10, 100],
    '万能': [22, 24, 26, 2, 14, 12, 100],
    '中長': [18, 20, 22, 2, 20, 18, 100],
    '長': [15, 17, 22, 2, 22, 22, 100],
  },
  '万能': {
    '短': [25, 26, 26, 2, 12, 9, 100],
    '短中': [22, 24, 26, 2, 14, 12, 100],
    '中': [18, 20, 30, 2, 16, 14, 100],
    '万能': [15, 18, 24, 10, 18, 15, 100],
    '中長': [13, 15, 26, 2, 24, 20, 100],
    '長': [10, 12, 28, 2, 26, 22, 100],
  },
  '長': {
    '短': [12, 15, 21, 2, 25, 25, 100],
    '短中': [15, 17, 22, 2, 22, 22, 100],
    '中': [10, 14, 30, 2, 22, 22, 100],
    '万能': [10, 12, 28, 2, 26, 22, 100],
    '中長': [8, 10, 24, 2, 28, 28, 100],
    '長': [6, 8, 22, 2, 31, 31, 100],
  },

}

export const marryGroundData = {
  '芝': {
    '芝': [65, 30, 5, 100],
    'ダ': [30, 65, 5, 100],
    '万': [45, 45, 10, 100],
  },

  'ダ': {
    '芝': [30, 65, 5, 100],
    'ダ': [65, 30, 5, 100],
    '万': [45, 45, 10, 100],
  },

  '万': {
    '芝': [45, 45, 10, 100],
    'ダ': [45, 45, 10, 100],
    '万': [33, 33, 34, 100],
  },
}

export const marryQualityLegData = {
  '大逃': {
    '大逃': [4, 35, 30, 15, 10, 2, 2, 2, 100],
    '逃げ': [2, 33, 30, 17, 12, 2, 2, 2, 100],
    '先行': [2, 28, 30, 20, 14, 2, 2, 2, 100],
    '差し': [2, 22, 25, 25, 20, 2, 2, 2, 100],
    '追い': [2, 18, 20, 27, 27, 2, 2, 2, 100],
    '自在': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    'まくり': [2, 11, 15, 33, 33, 2, 2, 2, 100],
    '直一気': [2, 10, 12, 35, 35, 2, 2, 2, 100]
  },
  '逃げ': {
    '大逃': [2, 22, 25, 25, 20, 2, 2, 2, 100],
    '逃げ': [2, 18, 29, 25, 20, 2, 2, 2, 100],
    '先行': [2, 15, 28, 28, 21, 2, 2, 2, 100],
    '差し': [2, 12, 25, 30, 25, 2, 2, 2, 100],
    '追い': [2, 10, 22, 30, 30, 2, 2, 2, 100],
    '自在': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    'まくり': [2, 8, 10, 37, 37, 2, 2, 2, 100],
    '直一気': [2, 3, 8, 39, 42, 2, 2, 2, 100]
  },
  '先行': {
    '大逃': [2, 11, 15, 33, 33, 2, 2, 2, 100],
    '逃げ': [2, 10, 12, 35, 35, 2, 2, 2, 100],
    '先行': [2, 9, 11, 36, 36, 2, 2, 2, 100],
    '差し': [2, 8, 10, 37, 37, 2, 2, 2, 100],
    '追い': [2, 7, 9, 38, 38, 2, 2, 2, 100],
    '自在': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    'まくり': [2, 3, 8, 39, 39, 2, 5, 2, 100],
    '直一気': [2, 1, 6, 41, 44, 2, 2, 2, 100]
  },
  '差し': {
    '大逃': [2, 33, 30, 17, 12, 2, 2, 2, 100],
    '逃げ': [2, 32, 25, 20, 15, 2, 2, 2, 100],
    '先行': [2, 25, 27, 23, 17, 2, 2, 2, 100],
    '差し': [2, 18, 29, 25, 20, 2, 2, 2, 100],
    '追い': [2, 13, 30, 27, 22, 2, 2, 2, 100],
    '自在': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    'まくり': [2, 10, 12, 35, 35, 2, 2, 2, 100],
    '直一気': [2, 5, 10, 37, 40, 2, 2, 2, 100]
  },
  '追い': {
    '大逃': [2, 18, 20, 27, 27, 2, 2, 2, 100],
    '逃げ': [2, 13, 30, 27, 22, 2, 2, 2, 100],
    '先行': [2, 11, 26, 30, 25, 2, 2, 2, 100],
    '差し': [2, 10, 22, 30, 30, 2, 2, 2, 100],
    '追い': [2, 8, 20, 32, 32, 2, 2, 2, 100],
    '自在': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    'まくり': [2, 7, 9, 38, 38, 2, 2, 2, 100],
    '直一気': [2, 2, 7, 40, 43, 2, 2, 2, 100]
  },
  '自在': {
    '大逃': [2, 10, 12, 35, 35, 2, 2, 2, 100],
    '逃げ': [2, 5, 10, 37, 40, 2, 2, 2, 100],
    '先行': [2, 4, 9, 38, 41, 2, 2, 2, 100],
    '差し': [2, 3, 8, 39, 42, 2, 2, 2, 100],
    '追い': [2, 2, 7, 40, 43, 2, 2, 2, 100],
    '自在': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    'まくり': [2, 2, 8, 41, 41, 2, 2, 2, 100],
    '直一気': [2, 1, 3, 42, 43, 2, 2, 5, 100]
  },
  'まくり': {
    '大逃': [2, 28, 30, 20, 14, 2, 2, 2, 100],
    '逃げ': [2, 25, 27, 23, 17, 2, 2, 2, 100],
    '先行': [2, 20, 30, 24, 18, 2, 2, 2, 100],
    '差し': [2, 15, 28, 28, 21, 2, 2, 2, 100],
    '追い': [2, 11, 26, 30, 25, 2, 2, 2, 100],
    '自在': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    'まくり': [2, 9, 11, 36, 36, 2, 2, 2, 100],
    '直一気': [2, 4, 9, 38, 41, 2, 2, 2, 100]
  },
  '直一気': {
    '大逃': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    '逃げ': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    '先行': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    '差し': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    '追い': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    '自在': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    'まくり': [2, 23, 23, 23, 23, 2, 2, 2, 100],
    '直一気': [2, 23, 23, 23, 23, 2, 2, 2, 100]
  },
}

export const marryColorData = {
  '鹿毛': {
    '鹿毛':   [50, 30, 10, 2, 2, 5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 100],
    '黒鹿毛': [40, 40, 10, 2, 2, 5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 100],
    '栗毛':   [40, 30, 20, 2, 2, 5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 100],
    '青鹿毛': [35, 25, 12, 20, 2, 5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 100],
    '青毛':   [30, 20, 12, 12, 20, 5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 100],
    '芦毛':   [30, 20, 15, 2, 2, 30, 1, 0, 0, 0, 0, 0, 0, 0, 0, 100],
    '栃栗毛': [30, 20, 15, 5, 5, 10, 15, 0, 0, 0, 0, 0, 0, 0, 0, 100],
    '白毛':   [20, 10, 10, 10, 10, 15, 10, 15, 0, 0, 0, 0, 0, 0, 0, 100],
    '海空毛': [15, 10, 10, 15, 15, 10, 5, 5, 15, 0, 0, 0, 0, 0, 0, 100],
    '赤毛':   [15, 5, 15, 10, 10, 10, 15, 5, 0, 15, 0, 0, 0, 0, 0, 100],
    '尾花栗毛': [15, 5, 15, 10, 10, 10, 10, 15, 5, 0, 15, 0, 0, 0, 0, 100],
    '星毛': [15, 15, 10, 15, 10, 10, 5, 5, 0, 0, 0, 15, 0, 0, 0, 100],
    '縞毛': [15, 15, 10, 15, 10, 10, 5, 5, 0, 0, 0, 0, 15, 0, 0, 100],
    '豹毛': [15, 5, 15, 10, 10, 10, 15, 5, 0, 0, 0, 0, 0, 15, 0, 100],
    '虹毛': [15, 10, 10, 10, 10, 10, 10, 10, 0, 0, 0, 0, 0, 0, 15, 100]
  }
}

export const knicksData = {
  '0' : 52, '1' : 30, '2' : 10, '3' : 1, '4' : 1, '5' : 1, '6' : 1, '7' : 1, '8' : 1, '9' : 1, '10' : 1
}

export const crossSingleData = {
  '0' : 60, '1' : 30, '2' : 10, '3' : 0, '4' : 0, '5' : 0, '6' : 0, '7' : 0, '8' : 0, '9' : 0, '10' : 0 
}

export const crossDoubleData = {
  '0' : 42, '1' : 40, '2' : 15, '3' : 1, '4' : 1, '5' : 1, '6' : 0, '7' : 0, '8' : 0, '9' : 0, '10' : 0 
}

export const abilityFactorFiveData = {
  '0' : 55, '1' : 25, '2' : 13, '3' : 4, '4' : 2, '5' : 1, '6' : 0, '7' : 0, '8' : 0, '9' : 0, '10' : 0 
}

export const abilityFactorTenData = {
  '0' : 23, '1' : 30, '2' : 20, '3' : 10, '4' : 5, '5' : 3, '6' : 3, '7' : 2, '8' : 2, '9' : 1, '10' : 1 
}

export const abilityFactorFifteenData = {
  '0' : 10, '1' : 22, '2' : 25, '3' : 15, '4' : 10, '5' : 4, '6' : 4, '7' : 3, '8' : 3, '9' : 2, '10' : 2 
}

export const abilityFactorTwentyData = {
  '0' : 5, '1' : 10, '2' : 21, '3' : 25, '4' : 15, '5' : 5, '6' : 5, '7' : 4, '8' : 4, '9' : 3, '10' : 3 
}